=== Create a layer to index a node

[source,cypher]
----
CALL spatial.addNativePointLayerGeohash('my-native-geohash-layer')
----

.Result

[opts="header",cols="1"]
|===
|node
a|
[source]
----
(:SpatialLayer {
    geomencoder: "org.neo4j.gis.spatial.encoders.NativePointEncoder",
    index_class: "org.neo4j.gis.spatial.index.LayerGeohashPointIndex",
    layer: "my-native-geohash-layer",
    layer_class: "org.neo4j.gis.spatial.SimplePointLayer",
    layercrs: "GEOGCS[\"WGS84(DD)\", \n  DATUM[\"WGS84\", \n    SPHEROID[\"WGS84\", 6378137.0, 298.257223563]], \n  PRIMEM[\"Greenwich\", 0.0], \n  UNIT[\"degree\", 0.017453292519943295], \n  AXIS[\"Geodetic longitude\", EAST], \n  AXIS[\"Geodetic latitude\", NORTH], \n  AUTHORITY[\"EPSG\",\"4326\"]]"
})
----

|===

Create a node to index

[source,cypher]
----
CREATE (n:Node {id: 42, latitude:60.1,longitude:15.2}) SET n.location=point(n) RETURN n
----

Index node

[source,cypher]
----
MATCH (n:Node) WITH n CALL spatial.addNode('my-native-geohash-layer',n) YIELD node RETURN node
----

.Result

[opts="header",cols="1"]
|===
|node
a|
[source]
----
(:SpatialIndex_geohash_my-native-geohash-layer:Node {
    _spatialindex_geohash_my-native-geohash-layer: "1110001001100110011110101101011110001011101011010001000100011101",
    bbox: [ 15.2, 60.1, 15.2, 60.1 ],
    gtype: 1,
    id: 42,
    latitude: 60.1,
    location: point({x: 15.2, y: 60.1, crs: 'wgs-84'}),
    longitude: 15.2
})
----

|===

Find node within distance

[source,cypher]
----
CALL spatial.withinDistance('my-native-geohash-layer',{lon:15.0,lat:60.0},100)
----

.Result

[opts="header",cols="2"]
|===
|distance|node
a|
[source]
----
15.713441434310283
----
a|
[source]
----
(:SpatialIndex_geohash_my-native-geohash-layer:Node {
    _spatialindex_geohash_my-native-geohash-layer: "1110001001100110011110101101011110001011101011010001000100011101",
    bbox: [ 15.2, 60.1, 15.2, 60.1 ],
    gtype: 1,
    id: 42,
    latitude: 60.1,
    location: point({x: 15.2, y: 60.1, crs: 'wgs-84'}),
    longitude: 15.2
})
----

|===

